----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 111, 111]             864
       BatchNorm2d-2         [-1, 32, 111, 111]              64
       BasicConv2d-3         [-1, 32, 111, 111]               0
            Conv2d-4         [-1, 32, 109, 109]           9,216
       BatchNorm2d-5         [-1, 32, 109, 109]              64
       BasicConv2d-6         [-1, 32, 109, 109]               0
            Conv2d-7         [-1, 64, 109, 109]          18,432
       BatchNorm2d-8         [-1, 64, 109, 109]             128
       BasicConv2d-9         [-1, 64, 109, 109]               0
           Conv2d-10           [-1, 80, 54, 54]           5,120
      BatchNorm2d-11           [-1, 80, 54, 54]             160
      BasicConv2d-12           [-1, 80, 54, 54]               0
           Conv2d-13          [-1, 192, 52, 52]         138,240
      BatchNorm2d-14          [-1, 192, 52, 52]             384
      BasicConv2d-15          [-1, 192, 52, 52]               0
           Conv2d-16           [-1, 64, 25, 25]          12,288
      BatchNorm2d-17           [-1, 64, 25, 25]             128
      BasicConv2d-18           [-1, 64, 25, 25]               0
           Conv2d-19           [-1, 48, 25, 25]           9,216
      BatchNorm2d-20           [-1, 48, 25, 25]              96
      BasicConv2d-21           [-1, 48, 25, 25]               0
           Conv2d-22           [-1, 64, 25, 25]          76,800
      BatchNorm2d-23           [-1, 64, 25, 25]             128
      BasicConv2d-24           [-1, 64, 25, 25]               0
           Conv2d-25           [-1, 64, 25, 25]          12,288
      BatchNorm2d-26           [-1, 64, 25, 25]             128
      BasicConv2d-27           [-1, 64, 25, 25]               0
           Conv2d-28           [-1, 96, 25, 25]          55,296
      BatchNorm2d-29           [-1, 96, 25, 25]             192
      BasicConv2d-30           [-1, 96, 25, 25]               0
           Conv2d-31           [-1, 96, 25, 25]          82,944
      BatchNorm2d-32           [-1, 96, 25, 25]             192
      BasicConv2d-33           [-1, 96, 25, 25]               0
           Conv2d-34           [-1, 32, 25, 25]           6,144
      BatchNorm2d-35           [-1, 32, 25, 25]              64
      BasicConv2d-36           [-1, 32, 25, 25]               0
       InceptionA-37          [-1, 256, 25, 25]               0
           Conv2d-38           [-1, 64, 25, 25]          16,384
      BatchNorm2d-39           [-1, 64, 25, 25]             128
      BasicConv2d-40           [-1, 64, 25, 25]               0
           Conv2d-41           [-1, 48, 25, 25]          12,288
      BatchNorm2d-42           [-1, 48, 25, 25]              96
      BasicConv2d-43           [-1, 48, 25, 25]               0
           Conv2d-44           [-1, 64, 25, 25]          76,800
      BatchNorm2d-45           [-1, 64, 25, 25]             128
      BasicConv2d-46           [-1, 64, 25, 25]               0
           Conv2d-47           [-1, 64, 25, 25]          16,384
      BatchNorm2d-48           [-1, 64, 25, 25]             128
      BasicConv2d-49           [-1, 64, 25, 25]               0
           Conv2d-50           [-1, 96, 25, 25]          55,296
      BatchNorm2d-51           [-1, 96, 25, 25]             192
      BasicConv2d-52           [-1, 96, 25, 25]               0
           Conv2d-53           [-1, 96, 25, 25]          82,944
      BatchNorm2d-54           [-1, 96, 25, 25]             192
      BasicConv2d-55           [-1, 96, 25, 25]               0
           Conv2d-56           [-1, 64, 25, 25]          16,384
      BatchNorm2d-57           [-1, 64, 25, 25]             128
      BasicConv2d-58           [-1, 64, 25, 25]               0
       InceptionA-59          [-1, 288, 25, 25]               0
           Conv2d-60           [-1, 64, 25, 25]          18,432
      BatchNorm2d-61           [-1, 64, 25, 25]             128
      BasicConv2d-62           [-1, 64, 25, 25]               0
           Conv2d-63           [-1, 48, 25, 25]          13,824
      BatchNorm2d-64           [-1, 48, 25, 25]              96
      BasicConv2d-65           [-1, 48, 25, 25]               0
           Conv2d-66           [-1, 64, 25, 25]          76,800
      BatchNorm2d-67           [-1, 64, 25, 25]             128
      BasicConv2d-68           [-1, 64, 25, 25]               0
           Conv2d-69           [-1, 64, 25, 25]          18,432
      BatchNorm2d-70           [-1, 64, 25, 25]             128
      BasicConv2d-71           [-1, 64, 25, 25]               0
           Conv2d-72           [-1, 96, 25, 25]          55,296
      BatchNorm2d-73           [-1, 96, 25, 25]             192
      BasicConv2d-74           [-1, 96, 25, 25]               0
           Conv2d-75           [-1, 96, 25, 25]          82,944
      BatchNorm2d-76           [-1, 96, 25, 25]             192
      BasicConv2d-77           [-1, 96, 25, 25]               0
           Conv2d-78           [-1, 64, 25, 25]          18,432
      BatchNorm2d-79           [-1, 64, 25, 25]             128
      BasicConv2d-80           [-1, 64, 25, 25]               0
       InceptionA-81          [-1, 288, 25, 25]               0
           Conv2d-82          [-1, 384, 12, 12]         995,328
      BatchNorm2d-83          [-1, 384, 12, 12]             768
      BasicConv2d-84          [-1, 384, 12, 12]               0
           Conv2d-85           [-1, 64, 25, 25]          18,432
      BatchNorm2d-86           [-1, 64, 25, 25]             128
      BasicConv2d-87           [-1, 64, 25, 25]               0
           Conv2d-88           [-1, 96, 25, 25]          55,296
      BatchNorm2d-89           [-1, 96, 25, 25]             192
      BasicConv2d-90           [-1, 96, 25, 25]               0
           Conv2d-91           [-1, 96, 12, 12]          82,944
      BatchNorm2d-92           [-1, 96, 12, 12]             192
      BasicConv2d-93           [-1, 96, 12, 12]               0
       InceptionB-94          [-1, 768, 12, 12]               0
           Conv2d-95          [-1, 192, 12, 12]         147,456
      BatchNorm2d-96          [-1, 192, 12, 12]             384
      BasicConv2d-97          [-1, 192, 12, 12]               0
           Conv2d-98          [-1, 128, 12, 12]          98,304
      BatchNorm2d-99          [-1, 128, 12, 12]             256
     BasicConv2d-100          [-1, 128, 12, 12]               0
          Conv2d-101          [-1, 128, 12, 12]         114,688
     BatchNorm2d-102          [-1, 128, 12, 12]             256
     BasicConv2d-103          [-1, 128, 12, 12]               0
          Conv2d-104          [-1, 192, 12, 12]         172,032
     BatchNorm2d-105          [-1, 192, 12, 12]             384
     BasicConv2d-106          [-1, 192, 12, 12]               0
          Conv2d-107          [-1, 128, 12, 12]          98,304
     BatchNorm2d-108          [-1, 128, 12, 12]             256
     BasicConv2d-109          [-1, 128, 12, 12]               0
          Conv2d-110          [-1, 128, 12, 12]         114,688
     BatchNorm2d-111          [-1, 128, 12, 12]             256
     BasicConv2d-112          [-1, 128, 12, 12]               0
          Conv2d-113          [-1, 128, 12, 12]         114,688
     BatchNorm2d-114          [-1, 128, 12, 12]             256
     BasicConv2d-115          [-1, 128, 12, 12]               0
          Conv2d-116          [-1, 128, 12, 12]         114,688
     BatchNorm2d-117          [-1, 128, 12, 12]             256
     BasicConv2d-118          [-1, 128, 12, 12]               0
          Conv2d-119          [-1, 192, 12, 12]         172,032
     BatchNorm2d-120          [-1, 192, 12, 12]             384
     BasicConv2d-121          [-1, 192, 12, 12]               0
          Conv2d-122          [-1, 192, 12, 12]         147,456
     BatchNorm2d-123          [-1, 192, 12, 12]             384
     BasicConv2d-124          [-1, 192, 12, 12]               0
      InceptionC-125          [-1, 768, 12, 12]               0
          Conv2d-126          [-1, 192, 12, 12]         147,456
     BatchNorm2d-127          [-1, 192, 12, 12]             384
     BasicConv2d-128          [-1, 192, 12, 12]               0
          Conv2d-129          [-1, 160, 12, 12]         122,880
     BatchNorm2d-130          [-1, 160, 12, 12]             320
     BasicConv2d-131          [-1, 160, 12, 12]               0
          Conv2d-132          [-1, 160, 12, 12]         179,200
     BatchNorm2d-133          [-1, 160, 12, 12]             320
     BasicConv2d-134          [-1, 160, 12, 12]               0
          Conv2d-135          [-1, 192, 12, 12]         215,040
     BatchNorm2d-136          [-1, 192, 12, 12]             384
     BasicConv2d-137          [-1, 192, 12, 12]               0
          Conv2d-138          [-1, 160, 12, 12]         122,880
     BatchNorm2d-139          [-1, 160, 12, 12]             320
     BasicConv2d-140          [-1, 160, 12, 12]               0
          Conv2d-141          [-1, 160, 12, 12]         179,200
     BatchNorm2d-142          [-1, 160, 12, 12]             320
     BasicConv2d-143          [-1, 160, 12, 12]               0
          Conv2d-144          [-1, 160, 12, 12]         179,200
     BatchNorm2d-145          [-1, 160, 12, 12]             320
     BasicConv2d-146          [-1, 160, 12, 12]               0
          Conv2d-147          [-1, 160, 12, 12]         179,200
     BatchNorm2d-148          [-1, 160, 12, 12]             320
     BasicConv2d-149          [-1, 160, 12, 12]               0
          Conv2d-150          [-1, 192, 12, 12]         215,040
     BatchNorm2d-151          [-1, 192, 12, 12]             384
     BasicConv2d-152          [-1, 192, 12, 12]               0
          Conv2d-153          [-1, 192, 12, 12]         147,456
     BatchNorm2d-154          [-1, 192, 12, 12]             384
     BasicConv2d-155          [-1, 192, 12, 12]               0
      InceptionC-156          [-1, 768, 12, 12]               0
          Conv2d-157          [-1, 192, 12, 12]         147,456
     BatchNorm2d-158          [-1, 192, 12, 12]             384
     BasicConv2d-159          [-1, 192, 12, 12]               0
          Conv2d-160          [-1, 160, 12, 12]         122,880
     BatchNorm2d-161          [-1, 160, 12, 12]             320
     BasicConv2d-162          [-1, 160, 12, 12]               0
          Conv2d-163          [-1, 160, 12, 12]         179,200
     BatchNorm2d-164          [-1, 160, 12, 12]             320
     BasicConv2d-165          [-1, 160, 12, 12]               0
          Conv2d-166          [-1, 192, 12, 12]         215,040
     BatchNorm2d-167          [-1, 192, 12, 12]             384
     BasicConv2d-168          [-1, 192, 12, 12]               0
          Conv2d-169          [-1, 160, 12, 12]         122,880
     BatchNorm2d-170          [-1, 160, 12, 12]             320
     BasicConv2d-171          [-1, 160, 12, 12]               0
          Conv2d-172          [-1, 160, 12, 12]         179,200
     BatchNorm2d-173          [-1, 160, 12, 12]             320
     BasicConv2d-174          [-1, 160, 12, 12]               0
          Conv2d-175          [-1, 160, 12, 12]         179,200
     BatchNorm2d-176          [-1, 160, 12, 12]             320
     BasicConv2d-177          [-1, 160, 12, 12]               0
          Conv2d-178          [-1, 160, 12, 12]         179,200
     BatchNorm2d-179          [-1, 160, 12, 12]             320
     BasicConv2d-180          [-1, 160, 12, 12]               0
          Conv2d-181          [-1, 192, 12, 12]         215,040
     BatchNorm2d-182          [-1, 192, 12, 12]             384
     BasicConv2d-183          [-1, 192, 12, 12]               0
          Conv2d-184          [-1, 192, 12, 12]         147,456
     BatchNorm2d-185          [-1, 192, 12, 12]             384
     BasicConv2d-186          [-1, 192, 12, 12]               0
      InceptionC-187          [-1, 768, 12, 12]               0
          Conv2d-188          [-1, 192, 12, 12]         147,456
     BatchNorm2d-189          [-1, 192, 12, 12]             384
     BasicConv2d-190          [-1, 192, 12, 12]               0
          Conv2d-191          [-1, 192, 12, 12]         147,456
     BatchNorm2d-192          [-1, 192, 12, 12]             384
     BasicConv2d-193          [-1, 192, 12, 12]               0
          Conv2d-194          [-1, 192, 12, 12]         258,048
     BatchNorm2d-195          [-1, 192, 12, 12]             384
     BasicConv2d-196          [-1, 192, 12, 12]               0
          Conv2d-197          [-1, 192, 12, 12]         258,048
     BatchNorm2d-198          [-1, 192, 12, 12]             384
     BasicConv2d-199          [-1, 192, 12, 12]               0
          Conv2d-200          [-1, 192, 12, 12]         147,456
     BatchNorm2d-201          [-1, 192, 12, 12]             384
     BasicConv2d-202          [-1, 192, 12, 12]               0
          Conv2d-203          [-1, 192, 12, 12]         258,048
     BatchNorm2d-204          [-1, 192, 12, 12]             384
     BasicConv2d-205          [-1, 192, 12, 12]               0
          Conv2d-206          [-1, 192, 12, 12]         258,048
     BatchNorm2d-207          [-1, 192, 12, 12]             384
     BasicConv2d-208          [-1, 192, 12, 12]               0
          Conv2d-209          [-1, 192, 12, 12]         258,048
     BatchNorm2d-210          [-1, 192, 12, 12]             384
     BasicConv2d-211          [-1, 192, 12, 12]               0
          Conv2d-212          [-1, 192, 12, 12]         258,048
     BatchNorm2d-213          [-1, 192, 12, 12]             384
     BasicConv2d-214          [-1, 192, 12, 12]               0
          Conv2d-215          [-1, 192, 12, 12]         147,456
     BatchNorm2d-216          [-1, 192, 12, 12]             384
     BasicConv2d-217          [-1, 192, 12, 12]               0
      InceptionC-218          [-1, 768, 12, 12]               0
          Conv2d-219          [-1, 192, 12, 12]         147,456
     BatchNorm2d-220          [-1, 192, 12, 12]             384
     BasicConv2d-221          [-1, 192, 12, 12]               0
          Conv2d-222            [-1, 320, 5, 5]         552,960
     BatchNorm2d-223            [-1, 320, 5, 5]             640
     BasicConv2d-224            [-1, 320, 5, 5]               0
          Conv2d-225          [-1, 192, 12, 12]         147,456
     BatchNorm2d-226          [-1, 192, 12, 12]             384
     BasicConv2d-227          [-1, 192, 12, 12]               0
          Conv2d-228          [-1, 192, 12, 12]         258,048
     BatchNorm2d-229          [-1, 192, 12, 12]             384
     BasicConv2d-230          [-1, 192, 12, 12]               0
          Conv2d-231          [-1, 192, 12, 12]         258,048
     BatchNorm2d-232          [-1, 192, 12, 12]             384
     BasicConv2d-233          [-1, 192, 12, 12]               0
          Conv2d-234            [-1, 192, 5, 5]         331,776
     BatchNorm2d-235            [-1, 192, 5, 5]             384
     BasicConv2d-236            [-1, 192, 5, 5]               0
      InceptionD-237           [-1, 1280, 5, 5]               0
          Conv2d-238            [-1, 320, 5, 5]         409,600
     BatchNorm2d-239            [-1, 320, 5, 5]             640
     BasicConv2d-240            [-1, 320, 5, 5]               0
          Conv2d-241            [-1, 384, 5, 5]         491,520
     BatchNorm2d-242            [-1, 384, 5, 5]             768
     BasicConv2d-243            [-1, 384, 5, 5]               0
          Conv2d-244            [-1, 384, 5, 5]         442,368
     BatchNorm2d-245            [-1, 384, 5, 5]             768
     BasicConv2d-246            [-1, 384, 5, 5]               0
          Conv2d-247            [-1, 384, 5, 5]         442,368
     BatchNorm2d-248            [-1, 384, 5, 5]             768
     BasicConv2d-249            [-1, 384, 5, 5]               0
          Conv2d-250            [-1, 448, 5, 5]         573,440
     BatchNorm2d-251            [-1, 448, 5, 5]             896
     BasicConv2d-252            [-1, 448, 5, 5]               0
          Conv2d-253            [-1, 384, 5, 5]       1,548,288
     BatchNorm2d-254            [-1, 384, 5, 5]             768
     BasicConv2d-255            [-1, 384, 5, 5]               0
          Conv2d-256            [-1, 384, 5, 5]         442,368
     BatchNorm2d-257            [-1, 384, 5, 5]             768
     BasicConv2d-258            [-1, 384, 5, 5]               0
          Conv2d-259            [-1, 384, 5, 5]         442,368
     BatchNorm2d-260            [-1, 384, 5, 5]             768
     BasicConv2d-261            [-1, 384, 5, 5]               0
          Conv2d-262            [-1, 192, 5, 5]         245,760
     BatchNorm2d-263            [-1, 192, 5, 5]             384
     BasicConv2d-264            [-1, 192, 5, 5]               0
      InceptionE-265           [-1, 2048, 5, 5]               0
          Conv2d-266            [-1, 320, 5, 5]         655,360
     BatchNorm2d-267            [-1, 320, 5, 5]             640
     BasicConv2d-268            [-1, 320, 5, 5]               0
          Conv2d-269            [-1, 384, 5, 5]         786,432
     BatchNorm2d-270            [-1, 384, 5, 5]             768
     BasicConv2d-271            [-1, 384, 5, 5]               0
          Conv2d-272            [-1, 384, 5, 5]         442,368
     BatchNorm2d-273            [-1, 384, 5, 5]             768
     BasicConv2d-274            [-1, 384, 5, 5]               0
          Conv2d-275            [-1, 384, 5, 5]         442,368
     BatchNorm2d-276            [-1, 384, 5, 5]             768
     BasicConv2d-277            [-1, 384, 5, 5]               0
          Conv2d-278            [-1, 448, 5, 5]         917,504
     BatchNorm2d-279            [-1, 448, 5, 5]             896
     BasicConv2d-280            [-1, 448, 5, 5]               0
          Conv2d-281            [-1, 384, 5, 5]       1,548,288
     BatchNorm2d-282            [-1, 384, 5, 5]             768
     BasicConv2d-283            [-1, 384, 5, 5]               0
          Conv2d-284            [-1, 384, 5, 5]         442,368
     BatchNorm2d-285            [-1, 384, 5, 5]             768
     BasicConv2d-286            [-1, 384, 5, 5]               0
          Conv2d-287            [-1, 384, 5, 5]         442,368
     BatchNorm2d-288            [-1, 384, 5, 5]             768
     BasicConv2d-289            [-1, 384, 5, 5]               0
          Conv2d-290            [-1, 192, 5, 5]         393,216
     BatchNorm2d-291            [-1, 192, 5, 5]             384
     BasicConv2d-292            [-1, 192, 5, 5]               0
      InceptionE-293           [-1, 2048, 5, 5]               0
          Linear-294                    [-1, 2]           4,098
================================================================
Total params: 21,789,666
Trainable params: 21,789,666
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 115.60
Params size (MB): 83.12
Estimated Total Size (MB): 199.30
----------------------------------------------------------------
